% Визначення діапазонів для a та b
a = 0.6:0.1:2; % значення a
b = 0.6:0.1:2; % значення b

n_a = length(a); % кількість точок для a
n_b = length(b); % кількість точок для b
y = zeros(n_a, n_b); % формування нульового масиву розміром n_a на n_b для виходу

% Обчислення значень y для всіх комбінацій a і b
for i = 1:n_a
    for j = 1:n_b
        y(i, j) = (a(i) + b(j)) / (sqrt(a(i)) + b(j)^2 - 1);
    end
end

% Побудова поверхні графіка функції
surf(a, b, y);
xlabel('a');
ylabel('b');
zlabel('y');
title('Графік функції y = (a + b) / (sqrt(a) + b^2 - 1)');
